workspace/InformationRegisters/АукИтогиЗавершенияЭтапов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИтогиЗавершенияЭтапов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРезультатаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаСтавки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукДанныеШапокПодведенияИтогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукДанныеШапокПодведенияИтогов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщийСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукДанныеТаблицПодведенияИтогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукДанныеТаблицПодведенияИтогов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РаспределяемаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтоПобедитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукРасчетИтоговПараметры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукРасчетИтоговПараметры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукРасчетИтоговПеременные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукРасчетИтоговПеременные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипПеременной</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПеременной</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Переменная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукРасчетИтоговРезультаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукРасчетИтоговРезультаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчастникВыбран</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПобедитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/CommonModules/АукОбщийВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СписокЭтаповПоУмолчаниюПоВидуАукциона(пВидАукциона) Экспорт

	Возврат Справочники.АукВидыАукционов.СписокЭтаповПоУмолчаниюПоВидуАукциона(пВидАукциона);
	
КонецФункции	

Функция КонтактныеЛицаУчастникаАукциона(пАукцион, пУчастник) Экспорт

	Возврат Справочники.АукАукционы.КонтактныеЛицаУчастникаАукциона(пАукцион, пУчастник);
	
КонецФункции	

Функция ТехническоеНаименованиеСоответствуетТребованиям(пТекущийОбъект, пИмяОбъектаМД) Экспорт
	
	Если Не СтрПодобнаПоРегулярномуВыражению(пТекущийОбъект.ТехническоеНаименование, АукОбщийКлиентСервер.Шаблон_ТехническоеНаименованиеЭлементовПВХ()) Тогда
		
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Техническое наименование содержит недопустимые символы'"));
		
	КонецЕсли; 
	
	Если ПланыВидовХарактеристик[пИмяОбъектаМД].СуществуетЭлементСТехническимНаименованием(пТекущийОбъект) Тогда
		
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Существует элемент с таким техническим наименованием'"));
		
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция НаименованиеСоответствуетТребованиям(пТекущийОбъект, пИмяОбъектаМД) Экспорт
	
	Если Не СтрПодобнаПоРегулярномуВыражению(пТекущийОбъект.Наименование, АукОбщийКлиентСервер.Шаблон_НаименованиеЭлементовПВХ()) Тогда
		
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Наименование содержит недопустимые символы'"));
		
	КонецЕсли; 
	
	Если ПланыВидовХарактеристик[пИмяОбъектаМД].СуществуетЭлементСНаименованием(пТекущийОбъект) Тогда
		
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Существует элемент с таким наименованием'"));
		
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция СписокПредставленийПоМассивуЭлементов(пЭлементыДанных, пОтборПоТипу = Неопределено) Экспорт

	Возврат ПланыВидовХарактеристик.АукЭлементыДанныхАукционов.СписокПредставленийПоМассивуЭлементов(пЭлементыДанных, пОтборПоТипу);	
	
КонецФункции

Функция ОписаниеСтруктурыСтавкиПоВидуАукциона(пВидАукциона) Экспорт

	Возврат Справочники.АукВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(пВидАукциона);
	
КонецФункции	

Функция КонтактныеЛицаУчастникаПоВидуАукциона(пУчастник, пВидАукциона) Экспорт

	Возврат Справочники.АукУчастникиАукционов.КонтактныеЛицаУчастникаПоВидуАукциона(пУчастник, пВидАукциона);
	
КонецФункции	

Функция КлючевыеДанныеАукциона(пАукцион) Экспорт 
	
	Возврат Справочники.АукАукционы.КлючевыеДанныеАукциона(пАукцион);
	
КонецФункции

Функция КлючевойПараметрАукциона(пАукцион, пПараметр) Экспорт 
	
	Возврат Справочники.АукАукционы.КлючевыеДанныеАукциона(пАукцион)[пПараметр];
	
КонецФункции

Функция ВыполнитьКонтрольКритическиВажныхНастроек(пДанныеАукциона) Экспорт
	Возврат АукОбщийСервер.ВыполнитьКонтрольДанныхАукциона(пДанныеАукциона);	
КонецФункции

Функция ДанныеАукционаДляПроверки(пАукцион) Экспорт
	Возврат Справочники.АукАукционы.ДанныеАукционаДляПроверки(пАукцион);	
КонецФункции

Функция УчастникиАукционаИИхКонтактныеЛицаПоВидуАукциона(пВидАукциона) Экспорт
	Возврат Справочники.АукУчастникиАукционов.УчастникиАукционаИИхКонтактныеЛицаПоВидуАукциона(пВидАукциона);	
КонецФункции

Функция ВидыАукционовСписком() Экспорт
	Возврат Справочники.АукВидыАукционов.ВидыАукционовСписком();	
КонецФункции	

Функция ТекстДоИПослеВШаблонеРезультатаРасчета(пСтрокаШаблона) Экспорт
	сткРез = Новый Структура("ТекстДо, ТекстПосле", "", "");
	
	масШаблонРезультата = СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(пСтрокаШаблона, АукОбщийКлиентСервер.Шаблон_ПредставлениеПромежуточногоИтогаCКлючевымСловом());
	
	Если масШаблонРезультата.Количество() = 2 Тогда 	
		Если масШаблонРезультата[0] = АукОбщийКлиентСервер.ОперандПредставленияПромежуточногоИтога() Тогда
			сткРез.ТекстПосле = масШаблонРезультата[1];	
		Иначе
			сткРез.ТекстДо = масШаблонРезультата[0];	
		КонецЕсли;
	ИначеЕсли масШаблонРезультата.Количество() = 3 Тогда
		сткРез.ТекстДо = масШаблонРезультата[0];
		сткРез.ТекстПосле = масШаблонРезультата[2];
	КонецЕсли;
	
	Возврат сткРез;
КонецФункции	

Функция ПараметрыАукционаПоВиду(пВидАукциона) Экспорт
	Возврат Справочники.АукВидыАукционов.ОписаниеСтруктурыПараметровПоВидуАукциона(пВидАукциона);	
КонецФункции	

Функция ЭлементыДанныхАукционовПоТехническимНаименованиям(пМасТехническиеНаименования) Экспорт
	Возврат ПланыВидовХарактеристик.АукЭлементыДанныхАукционов.ЭлементыДанныхАукционовПоТехническимНаименованиям(пМасТехническиеНаименования);	
КонецФункции	

Процедура СохранитьДанныеПромежуточногоЛидераЭтапа(пСткДанные) Экспорт
	Если Не пСткДанные.Свойство("ДатаЗаписи") Тогда
		пСткДанные.Вставить("ДатаЗаписи", ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	КонецЕсли;
	
	РегистрыСведений.АукИтогиЗавершенияЭтапов.ДобавитьЗапись(пСткДанные);
КонецПроцедуры

Процедура СохранитьДанныеОкончательныхИтогов(пСткДанные) Экспорт
	Если Не пСткДанные.Свойство("ДатаЗаписи") Тогда
		пСткДанные.Вставить("ДатаЗаписи", ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	КонецЕсли;
	
	Если Не пСткДанные.Свойство("Автор") Тогда
		пСткДанные.Вставить("Автор", ПараметрыСеанса.глТекПользователь);
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		// 1. Зафиксировать данные шапок
		РегистрыСведений.АукДанныеШапокПодведенияИтогов.ДобавитьЗапись(пСткДанные);
		
		// 2. Зафиксировать данные таблиц итогов
		РегистрыСведений.АукДанныеТаблицПодведенияИтогов.ЗафиксироватьИтогиАукциона(пСткДанные);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		стрОшибка = ОписаниеОшибки();
		
		ВызватьИсключение стрОшибка;		
	КонецПопытки;	
КонецПроцедуры

Функция СохранитьДанныеПобедителейЭтапов(пСткДанные) Экспорт	
	пСткДанные.Вставить("Автор",	ПараметрыСеанса.глТекПользователь);	
	пСткДанные.Вставить("ТекДата",	ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	
	масЗаписи1 = РегистрыСведений.АукРасчетИтоговПараметры.ПодготовитьДанныеДляЗаписи(пСткДанные);
	масЗаписи2 = РегистрыСведений.АукРасчетИтоговПеременные.ПодготовитьДанныеДляЗаписи(пСткДанные); 
	масЗаписи3 = РегистрыСведений.АукРасчетИтоговРезультаты.ПодготовитьДанныеДляЗаписи(пСткДанные);
	
	НачатьТранзакцию();
	
	Попытка
		РегистрыСведений.АукРасчетИтоговПараметры.ДобавитьЗаписи(масЗаписи1);
		РегистрыСведений.АукРасчетИтоговПеременные.ДобавитьЗаписи(масЗаписи2);	
		РегистрыСведений.АукРасчетИтоговРезультаты.ДобавитьЗаписи(масЗаписи3);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		стрОшибка = ОписаниеОшибки();
		
		ВызватьИсключение стрОшибка;
	КонецПопытки;
КонецФункции
	
#КонецОбласти

#Область РаботаСРегулярнымиВыражениями

Функция СтрокаПодобнаРегулярномуВыражению(пСтрока, пРегулярноеВыражение, пИгнорироватьРегистр = Ложь,
	пМногострочныйПоиск = Ложь) Экспорт

	Возврат СтрПодобнаПоРегулярномуВыражению(пСтрока, пРегулярноеВыражение, пИгнорироватьРегистр, пМногострочныйПоиск); 
	
КонецФункции

Функция СтрокаЗаменитьПоРегулярномуВыражению(пСтрока, пРегулярноеВыражение, пПодстрокаЗамены = "",
	пИгнорироватьРегистр = Ложь, пМногострочныйПоиск = Ложь) Экспорт

	Возврат СтрЗаменитьПоРегулярномуВыражению(пСтрока, пРегулярноеВыражение, пПодстрокаЗамены, пИгнорироватьРегистр, пМногострочныйПоиск);   
	
КонецФункции

Функция СтрокаНайтиВсеПоРегулярномуВыражению(пСтрока, пРегулярноеВыражение, пИгнорироватьРегистр = Ложь,
	пМногострочныйПоиск = Ложь) Экспорт
	
	масРезультат = Новый Массив;
	
	масВсеВхождения =  СтрНайтиВсеПоРегулярномуВыражению(пСтрока, пРегулярноеВыражение, пИгнорироватьРегистр, пМногострочныйПоиск);  
		
	Для Каждого ЭлВхождение Из масВсеВхождения Цикл
		
		сткЭлВхождение = Новый Структура("Значение, НачальнаяПозиция");
		
		ЗаполнитьЗначенияСвойств(сткЭлВхождение, ЭлВхождение); 
		
		масРезультат.Добавить(сткЭлВхождение);
		
	КонецЦикла;	
	
	Возврат масРезультат;
	
КонецФункции

Функция СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(пСтрока, пРегулярноеВыражение, пИгнорироватьРегистр = Ложь,
	пМногострочныйПоиск = Ложь, пБулТолькоУникальные = Ложь) Экспорт
	
	масРезультат = Новый Массив;
	
	масВсеВхождения =  СтрНайтиВсеПоРегулярномуВыражению(пСтрока, пРегулярноеВыражение, пИгнорироватьРегистр, пМногострочныйПоиск);  
	
	Для Каждого ЭлВхождение Из масВсеВхождения Цикл 	
		Если пБулТолькоУникальные Тогда
			Если масРезультат.Найти(ЭлВхождение.Значение) = Неопределено Тогда
				масРезультат.Добавить(ЭлВхождение.Значение);	
			КонецЕсли;	
		Иначе			
			масРезультат.Добавить(ЭлВхождение.Значение);
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат масРезультат;
	
КонецФункции

#КонецОбласти

#Область ПолучениеЭлементовНастроек

Функция ЭлементНастроек_Email() Экспорт

	Возврат ПланыВидовХарактеристик.АукЭлементыНастроекКаналовВзаимодействия.ЭлементНастроекПоТехническомуНаименованию("EMail");
	
КонецФункции	

#КонецОбласти 

#Область РаботаСФормулами

Функция ПроверитьФормулуРасчетаИСписокПеременных(пСткПараметры) Экспорт
	Возврат АукОбщийСервер.ПроверитьФормулуРасчетаИСписокПеременных(пСткПараметры);	
КонецФункции	

#КонецОбласти
